erpedt.СХК_Расширение/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fe779ac1-0e7f-489c-ad06-bec9af582428">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="d561ee5a-2a87-4205-93af-4902b1247d87">
    <name>УдалитьНоменклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="c79450ab-f8f1-43d9-948d-10c6481c5538">
    <name>УдалитьУпаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="93716140-4123-4913-8258-75356dec29a0">
    <name>УдалитьХарактеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="75e2d606-c8d4-4cfe-8f96-2eaa5c364409">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

erpedt.СХК_Расширение/src/InformationRegisters/СХК_ШтрихКодЭтикетки/СХК_ШтрихКодЭтикетки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СХК_ШтрихКодЭтикетки</name>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>ДокументОснования</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <dimensions>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

erpedt.СХК_Расширение/src/CommonModules/СХК_ТСДСклад/Module.bsl
Функция ОстатокЯчейкаНоменклатура(Ячейка,Номенклатура,Серия,ДатаЗапроса) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток КАК ВНаличииОстаток
	|ИЗ
	|	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки(&ДатаЗапроса,Ячейка = &Ячейка И 
	|																Номенклатура = &Номенклатура И
	|																Серия = &Серия	) КАК СХК_ТоварыНаСкладеОстатки";
	
	Запрос.УстановитьПараметр("ДатаЗапроса", ДатаЗапроса);	
	Запрос.УстановитьПараметр("Ячейка", Ячейка);	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Серия", Серия);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.ВНаличииОстаток;
	Иначе
		Возврат 0 ;
	КонецЕсли;
	
КонецФункции

Функция ПоискОрдераЯчейки(ДокументСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СХК_РазмещениеОрдер.Ячейка КАК Ячейка
	|ИЗ
	|	РегистрСведений.СХК_РазмещениеОрдер КАК СХК_РазмещениеОрдер
	|ГДЕ
	|	СХК_РазмещениеОрдер.ДокументОрдер = &ДокументОрдер";
	Запрос.УстановитьПараметр("ДокументОрдер",ДокументСсылка );
	
	Рез = Запрос.Выполнить().Выгрузить();

	Возврат Рез;
		
КонецФункции 


Функция ПоискСХКСписание(ДокументСсылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	               |	СХК_СписаниеЯчейки.Ссылка КАК Ссылка,
	               |	СХК_СписаниеЯчейки.Собран КАК Собран
	               |ИЗ
	               |	Документ.СХК_СписаниеЯчейки КАК СХК_СписаниеЯчейки
	               |ГДЕ
	               |	СХК_СписаниеЯчейки.ДокОснования = &ДокОснования
	               |	И СХК_СписаниеЯчейки.ПометкаУдаления = &ПометкаУдаления
	               |	И СХК_СписаниеЯчейки.Проведен = &Проведен";
	Запрос.УстановитьПараметр("ДокОснования",ДокументСсылка); 
	Запрос.УстановитьПараметр("ПометкаУдаления",Ложь);   
	Запрос.УстановитьПараметр("Проведен",Истина);   
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Собран;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции


Функция ПоискЯчейкиШК(ШтрихКод) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	               |	СХК_СкладЯчейки.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СХК_СкладЯчейки КАК СХК_СкладЯчейки
	               |ГДЕ
	               |	СХК_СкладЯчейки.ШтрихКод = &ШтрихКод";   
	Запрос.УстановитьПараметр("ШтрихКод",ШтрихКод); 
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;
	КонецЕсли;		
КонецФункции

Функция СодержимоеЯчейки(Ячейка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СХК_ТоварыНаСкладеОстатки.Номенклатура КАК Номенклатура,
	               |	СХК_ТоварыНаСкладеОстатки.Серия КАК Серия,
	               |	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток КАК ВНаличииОстаток
	               |ИЗ
	               |	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки КАК СХК_ТоварыНаСкладеОстатки
	               |ГДЕ
	               |	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток > 1
	               |	И СХК_ТоварыНаСкладеОстатки.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |	И СХК_ТоварыНаСкладеОстатки.Ячейка = &Ячейка";
	
	Запрос.УстановитьПараметр("Ячейка",Ячейка);   
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции	


Функция ПроверкаНаЧисло(НашаСтрокаДляРазбора) Экспорт
	Если ТипЗнч(НашаСтрокаДляРазбора) = Тип("Число") Тогда
		Возврат Истина
	Иначе
		Если ТипЗнч(НашаСтрокаДляРазбора) = Тип("Строка") Тогда
			Если НашаСтрокаДляРазбора = "" Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Попытка
			ПМ = Число(НашаСтрокаДляРазбора);
		Исключение
			Возврат Ложь;
		КонецПопытки;
		Возврат Истина;
	КонецЕсли;
КонецФункции   


Функция Разложить(Знач Стр, Разделитель = ";") Экспорт
	
	Список = Новый Массив();
	Длина = СтрДлина(Разделитель);
	
	Стр = СокрЛП(Стр);
	Поз = Найти(Стр, Разделитель);
	
	Пока 0 < Поз Цикл
		Список.Добавить(СокрП(Лев(Стр, Поз-1)));
		
		Стр = СокрЛ(Сред(Стр, Поз+Длина));
		Поз = Найти(Стр, Разделитель);
	КонецЦикла;
	
	Список.Добавить(Стр);
	
	Возврат Список;
	
КонецФункции



Функция ЗаполнитьУпаковкаУп(ШтрихКод,Номенклатура) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
	|	И ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("Штрихкод",ШтрихКод);
	//4630205928135
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда 
		Возврат Рез.Упаковка; 
	Иначе
		ЗапросСпаек = Новый Запрос;
		ЗапросСпаек.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СХК_Спайки.ОснНоменклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТ_ОсновнаяНоменклатура
		|ИЗ
		|	РегистрСведений.СХК_Спайки КАК СХК_Спайки
		|ГДЕ
		|	(СХК_Спайки.ДопНомеклатура = &Номенклатура
		|			ИЛИ СХК_Спайки.ОснНоменклатура = &Номенклатура)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
		|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка
		|
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОсновнаяНоменклатура КАК ВТ_ОсновнаяНоменклатура
		|		ПО (ШтрихкодыНоменклатуры.Номенклатура = ВТ_ОсновнаяНоменклатура.Номенклатура)
		//|			И (ШтрихкодыНоменклатуры.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка))
		|			
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
		ЗапросСпаек.УстановитьПараметр("Номенклатура",Номенклатура);
		ЗапросСпаек.УстановитьПараметр("Штрихкод",ШтрихКод);
		РезСпаек = ЗапросСпаек.Выполнить().Выбрать();
		Если РезСпаек.Следующий() Тогда 
			Возврат РезСпаек.Упаковка;
		Иначе 
			Возврат Ложь;
		КонецЕсли;		
	КонецЕсли;

КонецФункции

Функция СписаниеСклад(ДокументОснования) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СХК_СписаниеЯчейки.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.СХК_СписаниеЯчейки КАК СХК_СписаниеЯчейки
	               |ГДЕ
	               |	СХК_СписаниеЯчейки.ДокОснования = &ДокОснования
	               |	И СХК_СписаниеЯчейки.Проведен = ИСТИНА
	               |	И СХК_СписаниеЯчейки.ПометкаУдаления = ЛОЖЬ
	               |	И СХК_СписаниеЯчейки.Собран = ИСТИНА";
	Запрос.УстановитьПараметр("ДокОснования",ДокументОснования);
	Рез =  Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		Возврат Рез.Ссылка;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ВместимостьЯчейки(Ячейка,Количество) Экспорт   
	//Если Ячейка.Блокировка = Истина Тогда
	//	Ош = "Ячейка заблокирована";
	//Иначе
	//	
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	СХК_ТоварыНаСкладеОстатки.Номенклатура КАК Номенклатура,
	//               |	СХК_ТоварыНаСкладеОстатки.Серия КАК Серия,
	//               |	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток КАК ВНаличииОстаток
	//               |ИЗ
	//               |	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки КАК СХК_ТоварыНаСкладеОстатки
	//               |ГДЕ
	//               |	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток > 1
	//               |	И СХК_ТоварыНаСкладеОстатки.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	//               |	И СХК_ТоварыНаСкладеОстатки.Ячейка = &Ячейка";
	//
	//Запрос.УстановитьПараметр("Ячейка",Ячейка);   
	//
	//Возврат Запрос.Выполнить().Выгрузить();
	//
	//Возврат  Ош;

КонецФункции	


Функция ПроверкаДокументаПоступления(ДокументОснование) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Расш1_ПоступлениеСклад.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Расш1_ПоступлениеСклад КАК Расш1_ПоступлениеСклад
	|ГДЕ
	|	Расш1_ПоступлениеСклад.Товары.ДокументОснование = &ДокументОснование
	|	И Расш1_ПоступлениеСклад.Проведен = Истина
	|	И Расш1_ПоступлениеСклад.ПометкаУдаления = Ложь"; 
	Запрос.УстановитьПараметр("ДокументОснование",ДокументОснование); 
	Рез = Запрос.Выполнить().Выбрать(); 
	Если Рез.Следующий() Тогда
		Возврат Рез.Ссылка;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции 

Функция ПоискШтрихКодаНоменклатура(Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Первые 1
	               |	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |ГДЕ
	               |	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура"; 
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);  
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции  

Функция ПоискШтрихКодаШК(ШК) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |ГДЕ
	               |	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод"; 
	Запрос.УстановитьПараметр("Штрихкод",ШК);  
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции  


Функция СоздатьШтрихКод(Парам) Экспорт
	МаксимальныеЗначенияКодовШтучныхШтрихкодов = РегистрыСведений.ШтрихкодыНоменклатуры.ПолучитьМаксимальныеЗначенияКодовШтучныхШтрихкодов();
	МаксимальныйКодШтучногоТовара              = РегистрыСведений.ШтрихкодыНоменклатуры.МаксимальныйКодШтучногоТовара();	
	ПрефиксУзлаШтрихкода                       = РегистрыСведений.ШтрихкодыНоменклатуры.ПрефиксУзлаШтрихкода();
	
	Для Каждого СтрокаТЧМаксимальныеЗначения Из МаксимальныеЗначенияКодовШтучныхШтрихкодов Цикл
		
		Если Не СтрокаТЧМаксимальныеЗначения.Код < МаксимальныйКодШтучногоТовара Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТЧМаксимальныеЗначения.Код = СтрокаТЧМаксимальныеЗначения.Код + 1;
		
		Код      = СтрокаТЧМаксимальныеЗначения.Код; 
		Диапазон = СтрокаТЧМаксимальныеЗначения.Диапазон;
		
		Прервать;
	КонецЦикла;
	
	Если Код = Неопределено Тогда
		ВызватьИсключение РегистрыСведений.ШтрихкодыНоменклатуры.ТекстСообщенияНетСвободныхКодовШтучныхШтрихкодов();
	КонецЕсли;
	
	Штрихкод = РегистрыСведений.ШтрихкодыНоменклатуры.ПолучитьШтрихкодПоКоду(Код, Диапазон, ПрефиксУзлаШтрихкода);
					НовыйШтрихкод = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
					НовыйШтрихкод.Номенклатура = Парам.Номенклатура; 
					НовыйШтрихкод.Серия = Парам.СерииНоменклатуры;
					НовыйШтрихкод.Штрихкод = Штрихкод;
					НовыйШтрихкод.Записать();
	Возврат НовыйШтрихкод;
	
КонецФункции  
				
Функция ДоступныйОстатокПоСкладу(Номенклатура,Склад) Экспорт
	ВНаличииОстаток = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(&текДата,Номенклатура=&Номенклатура И Склад=&Склад) КАК ТоварыНаСкладахОстатки";
	Запрос.УстановитьПараметр("текДата",ТекущаяДата());
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("Склад",Склад);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		ВНаличииОстаток =  Рез.ВНаличииОстаток;
	КонецЕсли;
	
	Возврат ВНаличииОстаток;	
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С ДИАЛОГАМИ
// Создает запись в регистре сведений СХК_ШтрихКодЭтикетки с параметрами штрихкода номенклатуры поступления
//
// Параметры:
//   Парам - Структура - содержит данные для создания записи
//         * Номенклатура - СправочникСсылка.Номенклатура - номенклатура
//         * СерииНоменклатуры - СправочникСсылка.СерииНоменклатуры - серия номенклатуры
//         * Основание - ДокументСсылка.Поступление - документ-основание
//         * ШтрихКод - Строка - штрихкод

Процедура ЗаписатьНовыйШтрихкодНоменклатурыПоступления(Парам) Экспорт

					НовыйШтрихкод = РегистрыСведений.СХК_ШтрихКодЭтикетки.СоздатьМенеджерЗаписи();
					НовыйШтрихкод.Номенклатура = Парам.Номенклатура; 
					НовыйШтрихкод.Серия = Парам.СерииНоменклатуры;
					НовыйШтрихкод.Упаковка = Парам.СерииНоменклатуры.СХК_Упаковка;
					НовыйШтрихкод.ДокументОснования = Парам.Основание;
					НовыйШтрихкод.Штрихкод = Парам.ШтрихКод;
					НовыйШтрихкод.Записать();
	
КонецПроцедуры

// Определяет тип штрихкода по его значению
//
// Параметры:
//  ШтрихКод - Строка - значение штрихкода для анализа
//
// Возвращаемое значение:
//  Строка - тип штрихкода:
//   - "EAN13" - 13 цифр с правильной контрольной суммой
//   - "EAN8" - 8 цифр с правильной контрольной суммой
//   - "ITF14" - 14 цифр с правильной контрольной суммой
//   - "CODE128" - символы ASCII 0-127
//   - "EAN128" - CODE128 с разделителем GS1 или начинается с '('
//   - "CODE39" - символы формата CODE39
//   - "" - тип не определен
//
Функция ОпределитьТипШтрихкода(ШтрихКод) Экспорт
	
	Если Не ЗначениеЗаполнено(ШтрихКод) Тогда
		Возврат "";
	КонецЕсли;
	
	Результат = ОпределитьТипGTIN(ШтрихКод);
	Если Результат <> "" Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ОпределитьТипCODE(ШтрихКод);
	Возврат Результат;
	
КонецФункции

// Определяет тип GTIN штрихкода
//
// Параметры:
//  ШтрихКод - Строка - штрихкод для анализа
//
// Возвращаемое значение:
//  Строка - тип GTIN или пустая строка если не GTIN
//
Функция ОпределитьТипGTIN(ШтрихКод)
	
	Длина = СтрДлина(ШтрихКод);
	
	Если Длина = 13 И ПроверитьКонтрольнуюСуммуGTIN(ШтрихКод) Тогда
		Возврат "EAN13";
	ИначеЕсли Длина = 8 И ПроверитьКонтрольнуюСуммуGTIN(ШтрихКод) Тогда
		Возврат "EAN8";
	ИначеЕсли Длина = 14 И ПроверитьКонтрольнуюСуммуGTIN(ШтрихКод) Тогда
		Возврат "ITF14";
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

// Определяет тип CODE штрихкода (CODE128, EAN128, CODE39)
//
// Параметры:
//  ШтрихКод - Строка - штрихкод для анализа
//
// Возвращаемое значение:
//  Строка - тип CODE штрихкода или пустая строка
//
Функция ОпределитьТипCODE(ШтрихКод)
	
	Если ПроверитьCODE128(ШтрихКод) Тогда
		КодПервогоСимвола = КодСимвола(Лев(ШтрихКод, 1));
		
		Если КодПервогоСимвола = 40 Или СтрНайти(ШтрихКод, Символ(29)) > 0 Тогда
			Возврат "EAN128";
		Иначе
			Возврат "CODE128";
		КонецЕсли;
	КонецЕсли;
	
	Если ПроверитьCODE39(ШтрихКод) Тогда
		Возврат "CODE39";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

// Проверяет контрольную сумму по алгоритму GTIN
//
// Параметры:
//  ШтрихКод - Строка - штрихкод для проверки
//
// Возвращаемое значение:
//  Булево - Истина если контрольная сумма верна
//
Функция ПроверитьКонтрольнуюСуммуGTIN(Знач ШтрихКод)
	
	Если Не ПроверитьЦифрыСтроки(ШтрихКод) Тогда
		Возврат Ложь;
	КонецЕсли;
		
	Длина = СтрДлина(ШтрихКод);
	Коэффициент = ?(Длина % 2 = 0, 3, 1);
	
	Сумма = 0;
	Для Индекс = 1 По Длина - 1 Цикл
		КодСимвола = КодСимвола(Сред(ШтрихКод, Индекс, 1));
		Сумма = Сумма + Коэффициент * (КодСимвола - 48);
		Коэффициент = 4 - Коэффициент;
	КонецЦикла;
	
	КонтрольныйСимвол = (10 - Сумма % 10) % 10;
	КонтрольнаяЦифра = КодСимвола(Прав(ШтрихКод, 1)) - 48;
	
	Возврат КонтрольныйСимвол = КонтрольнаяЦифра;
	
КонецФункции

// Проверяет, что строка состоит только из цифр
//
// Параметры:
//  Строка - Строка - строка для проверки
//
// Возвращаемое значение:
//  Булево - Истина если строка состоит только из цифр
//
Функция ПроверитьЦифрыСтроки(Знач Строка)
	
	Для Индекс = 1 По СтрДлина(Строка) Цикл
		КодСимвола = КодСимвола(Сред(Строка, Индекс, 1));
		Если КодСимвола < 48 Или КодСимвола > 57 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Проверяет соответствие формату CODE128
//
// Параметры:
//  ШтрихКод - Строка - штрихкод для проверки
//
// Возвращаемое значение:
//  Булево - Истина если соответствует формату CODE128
//
Функция ПроверитьCODE128(Знач ШтрихКод)
	
	Для Индекс = 1 По СтрДлина(ШтрихКод) Цикл
		КодСимвола = КодСимвола(Сред(ШтрихКод, Индекс, 1));
		Если КодСимвола > 127 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Проверяет соответствие формату CODE39
//
// Параметры:
//  ШтрихКод - Строка - штрихкод для проверки
//
// Возвращаемое значение:
//  Булево - Истина если соответствует формату CODE39
//
Функция ПроверитьCODE39(Знач ШтрихКод)
	
	Для Индекс = 1 По СтрДлина(ШтрихКод) Цикл
		КодСимвола = КодСимвола(Сред(ШтрихКод, Индекс, 1));
		
		// Допустимые коды символов: 32 (пробел), 36-37 ($ %), 43 (+), 45-57 (-. / 0-9), 65-90 (A-Z)
		Если КодСимвола = 32 Тогда
			Продолжить;
		ИначеЕсли КодСимвола >= 36 И КодСимвола <= 37 Тогда
			Продолжить;
		ИначеЕсли КодСимвола = 43 Тогда
			Продолжить;
		ИначеЕсли КодСимвола >= 45 И КодСимвола <= 57 Тогда
			Продолжить;
		ИначеЕсли КодСимвола >= 65 И КодСимвола <= 90 Тогда
			Продолжить;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции
